package ru.mirea.task5;

import java.util.ArrayList;
import java.util.LinkedList;
import java.util.Arrays;

public class Main {
    public static void main(String[] args) {
        Integer[] array = {1, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 4, 6, 8, 9, 8, 8, 19, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 5, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678, 2, 3, 8, 9, 91, 92, 29, 19, 10, 1, 19, 19, 100, 39, 58, 39, 95, 6, 86, 678};

        ArrayList<Integer> arrayList = new ArrayList<>(Arrays.asList(array));
        LinkedList<Integer> linkedList = new LinkedList<>(Arrays.asList(array));

        long t1, t2;

        System.out.println("1. Операция вставки в начало.");
        t1 = System.nanoTime();
        arrayList.addFirst(25);
        t2 = System.nanoTime();
        System.out.printf("ArrayList: %d\n", t2-t1);
        t1 = System.nanoTime();
        linkedList.addFirst(25);
        t2 = System.nanoTime();
        System.out.printf("LinkedList: %d\n", t2-t1);

        System.out.println("2. Операция вставки в середину.");
        t1 = System.nanoTime();
        arrayList.add(25, 25);
        t2 = System.nanoTime();
        System.out.printf("ArrayList: %d\n", t2-t1);
        t1 = System.nanoTime();
        linkedList.add(25, 25);
        t2 = System.nanoTime();
        System.out.printf("LinkedList: %d\n", t2-t1);

        System.out.println("3. Операция вставки в конец.");
        t1 = System.nanoTime();
        arrayList.addLast(25);
        t2 = System.nanoTime();
        System.out.printf("ArrayList: %d\n", t2-t1);
        t1 = System.nanoTime();
        linkedList.addLast(25);
        t2 = System.nanoTime();
        System.out.printf("LinkedList: %d\n", t2-t1);

        System.out.println("4. Операция удаления.");
        t1 = System.nanoTime();
        arrayList.remove(125);
        t2 = System.nanoTime();
        System.out.printf("ArrayList: %d\n", t2-t1);
        t1 = System.nanoTime();
        linkedList.addLast(125);
        t2 = System.nanoTime();
        System.out.printf("LinkedList: %d\n", t2-t1);

        System.out.println("5. Операция поиска по образцу.");
        t1 = System.nanoTime();
        arrayList.remove(125);
        t2 = System.nanoTime();
        System.out.printf("ArrayList: %d\n", t2-t1);
        t1 = System.nanoTime();
        linkedList.addLast(125);
        t2 = System.nanoTime();
        System.out.printf("LinkedList: %d\n", t2-t1);
    }
}
